================================================================================
Simple enum
================================================================================

enum Simple {
    A
    B
    C
}

--------------------------------------------------------------------------------

(source_file
  (enum_declaration
    (type_identifier)
    (enum_variant_list
      (enum_variant
        (identifier))
      (enum_variant
        (identifier))
      (enum_variant
        (identifier)))))

================================================================================
Simple enum with type
================================================================================

enum SimpleWithType {
    A(i32)
    B(u32)
}

--------------------------------------------------------------------------------

(source_file
  (enum_declaration
    (type_identifier)
    (enum_variant_list
      (enum_tuple_variant
        (identifier)
        (primitive_type))
      (enum_tuple_variant
        (identifier)
        (primitive_type)))))

================================================================================
Simple enum with struct type
================================================================================

enum SimpleWithStructType {
    A (
        a: i32
        b: u32
    )
    B(i32)
}

--------------------------------------------------------------------------------

(source_file
  (enum_declaration
    (type_identifier)
    (enum_variant_list
      (enum_struct_variant
        (identifier)
        (field_declaration
          (field_identifier)
          (primitive_type))
        (field_declaration
          (field_identifier)
          (primitive_type)))
      (enum_tuple_variant
        (identifier)
        (primitive_type)))))

================================================================================
Enum with underlying type
================================================================================

enum IntegralWithUnderlyingType: i32 {
    Zero
    One = 2
    Two
}

--------------------------------------------------------------------------------

(source_file
  (enum_declaration
    (enum_integral_type
      (identifier)
      (primitive_type))
    (enum_variant_list
      (enum_variant
        (identifier))
      (enum_variant
        (identifier)
        (integer_literal))
      (enum_variant
        (identifier)))))

; ================================================================================
; NOT IMPLEMENTED Simple enum with Type Parameter
; ================================================================================
;
; enum SimpleWithTypeParameter<T> {
;     A(T)
;     B
; }
;
; --------------------------------------------------------------------------------
;
; (source_file)

; ================================================================================
; NOT IMPLEMENTED Simple enum with multiple Type Parameters
; ================================================================================
;
; enum SimpleWithMultipleTypeParameters<T, U> {
;     A(T)
;     B(U)
; }
;
; --------------------------------------------------------------------------------
;
; (source_file)
